# Grad Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..Grad Property
SymbolTypeId Class See Also
---
Symbol grad, indicating unit Gradians.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId Grad { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property Grad As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ Grad {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace